Catalogs/АР_ЗданияИЭтажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>АР_ЗданияИЭтажи</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолезнаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасположениеНаПлане</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ПланировкиПомещенийИПлощадей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/АР_ОбъектыАренды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>АР_ОбъектыАренды</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ТипыОбъектовАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПамятникИсторииИКультуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗданиеИЭтаж</Name>
					<Comment>Привязка к зданию и этажу</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ЗданияИЭтажи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасположениеНаПлане</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ПланировкиПомещенийИПлощадей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_НазначенияОбъектовНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧислоЭтажей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОбъектаАренды</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Этаж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГодПостройки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеХарактеристики</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияЗемель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_КатегорииЗемель</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_КатегорииЦенАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКонтролироватьЗанятость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧислоПодземныхЭтажей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКонтролироватьПлощадь</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КадастровыйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РНФИ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПрава</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АР_ВидыПравНаНедвижимость</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачиСвидетельстваОПраве</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерияСвидетельстваОПраве</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСвидетельстваОПраве</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписиВЕГРП</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЗаписиВЕГРП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВводаВЭксплуатацию</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыбытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Элементы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Элемент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АР_ЭлементыОбъектовАренды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/АР_ЗданияИЭтажи/Forms/ФормаПереносаДанных/Ext/Form/Module.bsl
&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыФормыВыбора = Новый Структура;
	ПараметрыФормыВыбора.Вставить("РежимОткрытияОкна",  РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ПараметрыФормыВыбора.Вставить("РежимВыбора",        Истина);
	ПараметрыФормыВыбора.Вставить("ЗакрыватьПриВыборе", Ложь);
	ПараметрыФормыВыбора.Вставить("МножественныйВыбор", Истина);
	
	ОткрытьФорму("Справочник.АР_ЗданияИЭтажи.ФормаВыбора", ПараметрыФормыВыбора, ЭтаФорма);
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьСписок(Команда)
	
	ЗаполнитьСписокНаСервере();
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьСписокНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АР_ЗданияИЭтажи.Ссылка КАК ЗданиеЭтаж
	|ИЗ
	|	Справочник.АР_ЗданияИЭтажи КАК АР_ЗданияИЭтажи
	|ГДЕ
	|	НЕ АР_ЗданияИЭтажи.ПометкаУдаления";
	
	ЗданияИЭтажи = Запрос.Выполнить().Выгрузить();
	
	ТаблицаЗданий.Загрузить(ЗданияИЭтажи);
	
КонецПроцедуры


&НаКлиенте
Процедура УстановитьТипОбъекта(Команда)
	
	ФормаВыбора = ПолучитьФорму("Справочник.АР_ТипыОбъектовАренды.ФормаВыбора", , ЭтаФорма);
	ТипОбъекта = ФормаВыбора.ОткрытьМодально();
	
	Если ЗначениеЗаполнено(ТипОбъекта) Тогда
		Для Каждого СтрокаТаблицы Из ТаблицаЗданий Цикл
			СтрокаТаблицы.ТипОбъекта = ТипОбъекта;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьЗаполнениеТиповОбъектов()
	
	Отказ = Ложь;
	НомерСтроки = 1;
	Для Каждого Стр Из ТаблицаЗданий Цикл
		Если НЕ ЗначениеЗаполнено(Стр.ТипОбъекта) Тогда
			ТекстСообщения = "В строке " + НомерСтроки + " не заполнен тип объекта";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "ТаблицаЗданий[" + Строка(НомерСтроки - 1) + "].ТипОбъекта", "Форма", Отказ);
		КонецЕсли;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	Возврат Отказ;
	
КонецФункции

&НаКлиенте
Процедура СоздатьОбъектыНедвижимости(Команда)
	
	Если НЕ ПроверитьЗаполнениеТиповОбъектов() Тогда
		СоздатьОбъектыНедвижимостиНаСервере();
		Оповестить("СозданыНовыеОбъектыАренды");
	КонецЕсли;	
		
КонецПроцедуры


&НаСервере
Процедура СоздатьОбъектыНедвижимостиНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТабличнаяЧасть", ТаблицаЗданий.Выгрузить());
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТабличнаяЧасть.ЗданиеЭтаж,
	|	ТабличнаяЧасть.ТипОбъекта
	|ПОМЕСТИТЬ ТабличнаяЧасть
	|ИЗ
	|	&ТабличнаяЧасть КАК ТабличнаяЧасть
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АР_ОбъектыАренды.Родитель КАК Родитель,
	|	АР_ОбъектыАренды.ЗданиеИЭтаж КАК ЗданиеИЭтаж,
	|	АР_ОбъектыАренды.Ссылка КАК ОбъектАренды,
	|	АР_ОбъектыАренды.ЗданиеИЭтаж.Наименование КАК Наименование,
	|	АР_ОбъектыАренды.ЗданиеИЭтаж.ОбщаяПлощадь КАК ОбщаяПлощадь,
	|	АР_ОбъектыАренды.ЗданиеИЭтаж.РасположениеНаПлане КАК РасположениеНаПлане,
	|	АР_ОбъектыАренды.ЕдиницаИзмерения,
	|	АР_ОбъектыАренды.Наименование КАК НаименованиеОбъекта,
	|	ТабличнаяЧасть.ТипОбъекта
	|ИЗ
	|	ТабличнаяЧасть КАК ТабличнаяЧасть
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
	|		ПО ТабличнаяЧасть.ЗданиеЭтаж = АР_ОбъектыАренды.ЗданиеИЭтаж
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование,
	|	НаименованиеОбъекта
	|ИТОГИ ПО
	|	Родитель,
	|	ЗданиеИЭтаж";
	
	ВыборкаРодитель = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаРодитель.Следующий() Цикл
		ВыборкаЗдание = ВыборкаРодитель.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаЗдание.Следующий() Цикл
			Выборка = ВыборкаЗдание.Выбрать();
			
			ЗданиеЭтаж = Справочники.АР_ОбъектыАренды.НайтиПоНаименованию(Строка(ВыборкаЗдание.ЗданиеИЭтаж), Истина, ВыборкаЗдание.Родитель); // если объект создается впервые
			Если НЕ ЗначениеЗаполнено(ЗданиеЭтаж) И ЗначениеЗаполнено(ВыборкаЗдание.Родитель) Тогда
				ЗданиеЭтаж = Справочники.АР_ОбъектыАренды.НайтиПоНаименованию(Строка(ВыборкаЗдание.ЗданиеИЭтаж), Истина, ВыборкаЗдание.Родитель.Родитель); // в случае повторного запуска
			КонецЕсли;
			Если ЗначениеЗаполнено(ЗданиеЭтаж) Тогда
				ОбъектЗданиеЭтаж = ЗданиеЭтаж.ПолучитьОбъект();
			Иначе
				ОбъектЗданиеЭтаж = Справочники.АР_ОбъектыАренды.СоздатьЭлемент();
				ОбъектЗданиеЭтаж.Родитель = ВыборкаРодитель.Родитель;
				ТекстСообщения = "Создан объект недвижимости " + Строка(ВыборкаЗдание.ЗданиеИЭтаж);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
			
			ЭтоПервый = Истина;
			
			Пока Выборка.Следующий() Цикл
				
				Если ЭтоПервый Тогда
					ОбъектЗданиеЭтаж.Наименование = Выборка.Наименование;
					ОбъектЗданиеЭтаж.ЗначениеХарактеристики = Выборка.ОбщаяПлощадь;
					ОбъектЗданиеЭтаж.РасположениеНаПлане = Выборка.РасположениеНаПлане;
					ОбъектЗданиеЭтаж.ЕдиницаИзмерения = Выборка.ЕдиницаИзмерения;
					ОбъектЗданиеЭтаж.ТипОбъекта = Выборка.ТипОбъекта;
					ОбъектЗданиеЭтаж.Записать();
				КонецЕсли;
				
				ОбъектАренды = Выборка.ОбъектАренды.ПолучитьОбъект();
				ОбъектАренды.Родитель = ОбъектЗданиеЭтаж.Ссылка;
				ОбъектАренды.Записать();

				Если ЭтоПервый Тогда
					Попытка
						УстановитьКИ(Выборка.ОбъектАренды);
					Исключение
					КонецПопытки;
					ЭтоПервый = Ложь;
				КонецЕсли;	
					
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ПоказатьОписание(Команда)
	
	ПоказыватьВстроеннуюСправку = Не ПоказыватьВстроеннуюСправку;
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВстроеннаяСправка = Справочники.АР_ЗданияИЭтажи.ПолучитьТекстВстроеннойСправки();
	ПоказыватьВстроеннуюСправку = Истина;
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	Элементы.ГруппаВстроеннаяСправка.Видимость = Форма.ПоказыватьВстроеннуюСправку;
	Элементы.ФормаПоказатьОписание.Заголовок = ?(Форма.ПоказыватьВстроеннуюСправку, "Скрыть справку", "Показать справку");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьКИ(ОбъектАренды)
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
			Для Каждого ЗданиеЭтаж Из ВыбранноеЗначение Цикл
				Если ТаблицаЗданий.НайтиСтроки(Новый Структура("ЗданиеЭтаж", ЗданиеЭтаж)).Количество() = 0 Тогда
					СтрокаТаблицы = ТаблицаЗданий.Добавить();
					СтрокаТаблицы.ЗданиеЭтаж = ЗданиеЭтаж;
				КонецЕсли;
			КонецЦикла;
		Иначе
			Если ТаблицаЗданий.НайтиСтроки(Новый Структура("ЗданиеЭтаж", ВыбранноеЗначение)).Количество() = 0 Тогда
				СтрокаТаблицы = ТаблицаЗданий.Добавить();
				СтрокаТаблицы.ЗданиеЭтаж = ВыбранноеЗначение;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
